
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.fis-kv-vault.azurerm_key_vault.kv
  * module.fis-kv-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.fis-kv-vault.azurerm_key_vault_access_policy.developer[0]
  * module.fis-kv-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.fis-kv-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.fis-kv-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.fis-kv-vault.azurerm_user_assigned_identity.managed_identity[0]
* Delete
  * module.fis-app-vault.azurerm_key_vault.kv
  * module.fis-app-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.fis-app-vault.azurerm_user_assigned_identity.managed_identity[0]
* Replace
  * azurerm_key_vault_secret.appInsights-InstrumentationKey


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsights-InstrumentationKey must be replaced
-/+ resource "azurerm_key_vault_secret" "appInsights-InstrumentationKey" {
      ~ id           = "https://fis-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/2a4bc2e2bd5149448979e80adda829a3" -> (known after apply)
      ~ key_vault_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        name         = "AppInsightsInstrumentationKey"
      - tags         = {} -> null
        value        = (sensitive value)
      ~ version      = "2a4bc2e2bd5149448979e80adda829a3" -> (known after apply)
    }

  # module.fis-app-vault.azurerm_key_vault.kv will be destroyed
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Purge",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                  - "Encrypt",
                  - "Decrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                  - "Release",
                ]
              - object_id               = "69a0dd60-bbb3-4621-8f29-f482efe9287d"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Purge",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                  - "Encrypt",
                  - "Decrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                  - "Release",
                ]
              - object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> null
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = true -> null
      - enabled_for_disk_encryption     = true -> null
      - enabled_for_template_deployment = true -> null
      - id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> null
      - location                        = "uksouth" -> null
      - name                            = "fis-aat" -> null
      - purge_protection_enabled        = true -> null
      - resource_group_name             = "fis-aat" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_enabled             = true -> null
      - soft_delete_retention_days      = 90 -> null
      - tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          - "Team Contact"        = "#family-integration-cicd-notice"
          - "application"         = "family-integration-systems"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#family-integration-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Family Integration Stream"
        } -> null
      - tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - vault_uri                       = "https://fis-aat.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # module.fis-app-vault.azurerm_monitor_diagnostic_setting.kv-ds will be destroyed
  - resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      - id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat|fis-aat" -> null
      - log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                       = "fis-aat" -> null
      - target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> null

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.fis-app-vault.azurerm_user_assigned_identity.managed_identity[0] will be destroyed
  - resource "azurerm_user_assigned_identity" "managed_identity" {
      - client_id           = "fe0865ed-1521-442a-a848-729ee65773ea" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/fis-aat-mi" -> null
      - location            = "uksouth" -> null
      - name                = "fis-aat-mi" -> null
      - principal_id        = "d9f385f1-a7ba-4ab5-97e2-d2b5b6d1dc89" -> null
      - resource_group_name = "managed-identities-aat-rg" -> null
      - tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          - "Team Contact"        = "#family-integration-cicd-notice"
          - "application"         = "family-integration-systems"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#family-integration-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Family Integration Stream"
        } -> null
    }

  # module.fis-kv-vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "fis-kv-aat"
      + purge_protection_enabled        = true
      + resource_group_name             = "fis-aat"
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          + "Team Contact"        = "#family-integration-cicd-notice"
          + "application"         = "family-integration-systems"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#family-integration-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Family Integration Stream"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.fis-kv-vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-kv-vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-kv-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-kv-vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "22e66b72-e6ae-4b3a-a239-b0384287911b"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-kv-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "fis-kv-aat"
      + target_resource_id         = (known after apply)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

  # module.fis-kv-vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "fis-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          + "Team Contact"        = "#family-integration-cicd-notice"
          + "application"         = "family-integration-systems"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#family-integration-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Family Integration Stream"
        }
    }

Plan: 8 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Vars":{}} -->